[
  {
    "path": "posts/2021-08-30-hands-on-exercise-2/",
    "title": "Hands-On Exercise 2",
    "description": "Today's Adventure: Geospatial Data Wrangling with R! Using the sf package, let's learn the ropes of handling geospatial data in R: from importing to projection, we've got you covered 💪 You might even learn a geoprocessing tip or two 😄",
    "author": [
      {
        "name": "Megan Sim",
        "url": "https://www.linkedin.com/in/megan-sim-tze-yen/"
      }
    ],
    "date": "2021-08-30",
    "categories": [
      "Hands-On Exercise",
      "R",
      "sf",
      "ggplot2"
    ],
    "contents": "\r\n\r\nContents\r\n1.0 Overview\r\n2.0 Setup\r\n2.1 Packages Used\r\n2.2 Data Used\r\n\r\n3.0 Importing Geospatial Data into R\r\n3.1 Importing polygon feature data in shapefile format\r\n3.2 Importing polyline feature data in shapefile form\r\n3.3 Importing GIS data in kml format\r\n\r\n4.0 Importing + Converting Aspatial Data into R\r\n4.1 Importing aspatial data\r\n4.2 Converting aspatial data\r\n4.3 Combining it together: Importing asptial data as sf\r\n\r\n5.0 Geoprocessing\r\n5.1 Buffering\r\n5.2 Point-In-Polygon Count\r\n\r\n6.0 Exploratory Data Analysis (EDA)\r\n6.1 DIY section\r\n\r\n\r\n1.0 Overview\r\nBefore we even start, you might be wondering: why geospatial analytics? Why are we learning about it, and how is it relevant to a business or a governmental/academic institution?\r\nA quick Google search brings up thousands upon thousands of answers, articles, and research papers: I recommend [Deloitte’s 3-Minute Guide] (https://www2.deloitte.com/content/dam/Deloitte/global/Documents/Deloitte-Analytics/dttl-analytics-us-ba-geospatial3minguide.pdf) on why geospatial analytics matters and the value it brings to a business its data.\r\n\r\n\r\nIn today’s Hands-On Exercise, we’ll be doing an introduction to geospatial analytics in R: - importing the data and (if necessary) converting it into an accessible format - carrying out geoprocessing tasks with sf - carrying out data wrangling tasks with dplyr - performing Exploratory Data Analysis (EDA) with ggplot2\r\n2.0 Setup\r\n2.1 Packages Used\r\n\r\n\r\nThe R packages we’ll be introducing today are: - sf: used for importing, managing, and processing geospatial data - tidyverse: used for importing, wrangling and visualising data (and other data science tasks!)\r\n\r\nNote: Tidyverse consists of a family of R packages, such as readr, tidyr, and dplyr - these are used for the different steps of the data wrangling + visualisation process!\r\n\r\nHere’s a handy code chunk that we’ll likely be putting at the start of every file: it (a) creates a list of packages, (b) checks if they have been installed (and installs it for us if they haven’t), and lastly (c) launches them in the Rstudio environment.\r\n\r\n\r\nShow code\r\n\r\npackages = c('sf', 'tidyverse')\r\nfor (p in packages){\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p,character.only = T)\r\n}\r\n\r\n\r\n\r\n2.2 Data Used\r\nThe datasets used for this exercise are: - Master Plan 2014 Subzone Boundary (Web) from data.gov.sg - Pre-Schools Location from data.gov.sg - Cycling Path from LTADataMall - Singapore Airbnb listing data, 19 July 2021 from Inside Airbnb\r\nA good practice would be to put the data sets in a ‘data’ folder, sorted accordingly into ‘geospatial’ and ‘aspatial’ folders.\r\n\r\n\r\n3.0 Importing Geospatial Data into R\r\n3.1 Importing polygon feature data in shapefile format\r\nst_read\r\ntest\r\nglimpse\r\ntest\r\n3.2 Importing polyline feature data in shapefile form\r\nst_read\r\nglimpse\r\n3.3 Importing GIS data in kml format\r\nst_read\r\nglimpse\r\n4.0 Importing + Converting Aspatial Data into R\r\n4.1 Importing aspatial data\r\nread_csv\r\nglimpse\r\n4.2 Converting aspatial data\r\nst_as_sf\r\nglimpse\r\n4.3 Combining it together: Importing asptial data as sf\r\nimport as sf\r\nglimpse\r\n5.0 Geoprocessing\r\n5.1 Buffering\r\n5.2 Point-In-Polygon Count\r\n6.0 Exploratory Data Analysis (EDA)\r\n6.1 DIY section\r\nDIY: Using ggplot2, plot a scatterplot showing the relationship between Pre-school Density and Pre-school Count.\r\nLet’s approach this step-by-step. Firstly, we’ll need the variables Pre-school Density and Pre-school Count. Luckily, we’ve already created both in 2.5.2 Point-In-Polygon Count, but assuming we haven’t done so, here’s the code for initialising the variables:\r\nNext, we need to plot a scatterplot. For our histogram, we used geom_histogram - and for a scatterplot, we’ll use geom_point. We can further customise this by adjusting the colour, size and fill of the points, like so:\r\nSeem finished? There’s actually one more step: ensuring that your data is presented as fairly as possible - we don’t want to mislead our readers 😱 In this case, notice that the aspect ratio of our graph is off - its height is greater than its width. Let’s correct that by setting limiters with the xlim() and ylim() functions inside ggplot2:\r\nAnd there we have it!\r\nWe’ve just started on our Geospatial Analytics Journey - walk with me as we dive deeper the coming weeks! 🤗 💖 ✨\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-30T22:21:53+08:00",
    "input_file": "hands-on-exercise-2.knit.md"
  },
  {
    "path": "posts/2021-08-23-in-class-exercise-2/",
    "title": "In-Class Exercise 2",
    "description": "This is a dummy blog post for testing out the various ins and outs of a Distill blog. In this hands-on exercise, I learned how to handle geospatial data in R by using the sf package.",
    "author": [
      {
        "name": "Megan Sim",
        "url": "https://www.linkedin.com/in/megan-sim-tze-yen/"
      }
    ],
    "date": "2021-08-23",
    "categories": [],
    "contents": "\r\nGetting Started\r\nThis code chunk performs three tasks:\r\nA packaging list call packages will be created. It consists of all the R packages required to accomplish this hands-on exercise.\r\nNext, the code chunk will check if the R packages in packages have been installed in R. If they have yet been installed, they will be installed.\r\nAfter all the R packages have been installed, they will be launched in RStudio environment.\r\n\r\n\r\npackages <- c('sf', 'tidyverse')\r\nfor(p in packages){\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-30T19:56:18+08:00",
    "input_file": {}
  }
]
